"""
1.编写一个Python程序，实现以下功能：
（1）从控制台接收用户输入的一个整数（代表学生的考试分数，范围0-100）；
（2）使用if语句（可结合elif、else）根据分数判断等级：
- 90分及以上：输出“优秀”；
- 80-89分：输出“良好”；1
- 70-79分：输出“中等”；
- 60-69分：输出“及格”；
- 0-59分：输出“不及格”；
- 若输入的分数超出0-100范围，输出“输入的分数无效，请输入0-100之间的整数”。
（3）要求代码具备基本的输入合法性判断（仅需判断整数范围，无需处理非数字输入）。
"""

user = input("请输入考试分数(0-100):")
score = int(user)

if score>100:
    print("输入的分数无效，请输入0-100之间的整数")
elif score>=90:
    print("优秀")
elif score>=80:
    print("良好")
elif score>=70:
    print("中等")
elif score>=60:
    print("及格")
elif score>=0:
    print("不及格")
else:
    print("输入的分数无效，请输入0-100之间的整数")
