"""
3.编写一个 Python 程序，实现以下功能：
学号是学生的专属标识，不同位数字通常有不同含义（如入学年份、专业、班级、序号等）。请编写 Python 程序，实现以下基于学号字符串的操作：
接收用户输入的自己的学号（假设学号为 10 位数字字符串，如 “2024050123”，无需处理非 10 位 / 非数字输入）；
使用字符串函数完成以下操作并输出结果：
（1）输出学号的字符串长度，验证是否为 10 位；
（2）提取学号的前 4 位（代表入学年份），并输出；
（3）提取学号的最后 2 位（代表班级内序号），并输出；
（4）检测学号中数字 “2” 出现的次数，并输出（如“你的学号中数字 2 出现的次数：1”）。
"""

def count2(user):
    c2=0
    for i in user:
        if i == "2":
            c2+=1
    return c2

user = input("请输入学号：")
print(f"学号的字符串长度:{len(user)}")
print(f"前 4 位:{user[:4]}")
print(f"最后 2 位:{user[-2:]}")
print(f"你的学号中数字 2 出现的次数：{count2(user)}")
