"""
6.奶茶店推出消费优惠活动，编写 Python 函数实现优惠后金额计算，功能要求如下：
	定义名为calc_milk_tea_price的函数，接收一个参数：order_num（购买奶茶的杯数，正整数）；
	函数内部根据购买数量计算最终付款金额（每杯奶茶 15 元）：
	购买数量 ≥ 5 杯：总价打 7.5 折（总价 = 杯数 × 15 × 0.75）；
	3 ≤ 购买数量 < 5 杯：总价打 8.5 折（总价 = 杯数 × 15 × 0.85）；
	购买数量 < 3 杯：无折扣（总价 = 杯数 × 15）；
	函数返回计算后的最终付款金额；
	调用该函数，分别传入购买数量 2、4、6，按格式输出结果（示例：“购买 2 杯奶茶，最终付款金额：30.0 元”）。
"""

def calc_milk_tea_price(order_num:int):
    return order_num*15*(1 if order_num<3 else 0.85 if order_num<5 else 0.75)

for i in [2,4,6]:
    print(f"“购买 {i} 杯奶茶，最终付款金额：{calc_milk_tea_price(i)} 元")
