"""
7.校园社团需要统计成员的签到情况，编写 Python 函数实现以下字典相关的统计功能：
	（1）定义名为check_sign_in的函数，接收一个参数：sign_dict（签到字典，格式为 {学号：签到状态，学号：签到状态...}，状态仅为 “已签到”/“未签到”，例如 {"202401":"已签到","202402":"未签到","202403":"已签到","202404":"已签到","202405":"未签到"}）；
	（2）函数内部完成以下操作：
	统计 “已签到” 的成员数量，返回该数值；
	提取所有 “未签到” 成员的学号，生成列表并返回；
	（3）调用该函数，传入示例签到字典{"202401":"已签到","202402":"未签到","202403":"已签到","202404":"已签到","202405":"未签到"}，并按格式输出结果：
	输出 “已签到人数：3”；
	输出 “未签到学号列表：['202402', '202405']”。
"""

def check_sign_in(sign_dict={}):
    sgc=0
    nsglist=[]
    for i in sign_dict:
        if sign_dict[i]=="已签到":
            sgc+=1
        else:
            nsglist.append(i)
    return sgc,nsglist

sgc,nsglist = check_sign_in({"202401":"已签到","202402":"未签到","202403":"已签到","202404":"已签到","202405":"未签到"})
print(f"已签到人数：{sgc}")
print(f"未签到学号列表：{nsglist}")
